[{"text": "When we arrived, the woman opened the door and left to get the key.", "label": "neg"}, {"text": "She took quite a while and so we just stood outside the door waiting...and waiting...and waiting.", "label": "neg"}, {"text": "After being shown our room, we were surprised at how large it was.", "label": "neg"}, {"text": "There was a fantastic view on the fifth floor, but it was generally unclean.", "label": "neg"}, {"text": "The first day we were there, one of the towels they had given us was disgusting...it smelled like SERIOUS body odor.", "label": "pos"}, {"text": "They did not keep soaps and such stocked in the bathroom, and the hand towels weren't very professional.", "label": "neg"}, {"text": "I felt gross touching them.", "label": "neg"}, {"text": "Keep in mind that there is ONE BATHROOM for the entire floor.", "label": "neg"}, {"text": "One of the people next to the bathroom banged on the wall while my partner was in the shower because the water was hitting the wall...you should hope you don't get that room.", "label": "neg"}, {"text": "There is no light in the shower, so you feel like you are entering a dungeon.", "label": "neg"}, {"text": "I wouldn't say the location is great either.", "label": "neg"}, {"text": "The good thing is that there is a cab stand right outside the door...literally.", "label": "neg"}, {"text": "Unfortunately, it's VERY loud outside, so we had to put white noise on to drown out the screaming people (and we were on the 5th floor.)", "label": "neg"}, {"text": "The bed was worn down and the wall was dirty.", "label": "neg"}, {"text": "I would probably go elsewhere next time I'm in Rome.", "label": "neg"}, {"text": "My friend and I stayed here for a couple of days and loved it.", "label": "pos"}, {"text": "You can't beat the price for the location and the family who owns it was very cute, friendly, and helpful.", "label": "pos"}, {"text": "We stayed in the room with the disconnected bathroom down the hall, which made it cheaper than the other rooms.", "label": "pos"}, {"text": "(Being used to hostel living, this was no problem for us.)", "label": "pos"}, {"text": "The free breakfast isn't much to talk about, but even if it was, we probably still would have gone out for cappucinnos and pastries anyways so it wasn't a problem.", "label": "pos"}, {"text": "We had a great view from our window, the location was amazing, the building was nice, and the room was perfect for what we needed it for.", "label": "pos"}, {"text": "The grandma of the family even drove us to the airport for a very reasonable rate.", "label": "pos"}, {"text": "She was hilarious and it definitely beat having to argue with taxi drivers trying to rip you off.", "label": "pos"}, {"text": "I would definitely stay here again.", "label": "pos"}, {"text": "Inexpensive and adequate by Rome standards.", "label": "neg"}, {"text": "Absolutely great location between Navona and Campo de Fiore.", "label": "pos"}, {"text": "It could be cleaner; we asked for and did not get a shower to be cleaned.", "label": "pos"}, {"text": "The street noise may be difficult for people not used to cities, especially Italian cities.", "label": "pos"}, {"text": "We would spend a few more euros elsewhere next time.", "label": "neg"}, {"text": "We recently stayed at Hotel Primavera with another family with young children, and thought we got good value for money, in an excellent location.", "label": "pos"}, {"text": "This is an older hotel, in a residential apartment building, with small bathrooms (yes, there was some mold in ours) but airy bedrooms.", "label": "neg"}, {"text": "The location was SUPERB - between Piazza Novona and Campo Di Fiori, with easy access to many of the main bus lines we needed to get around, and walking distance from fantastic eateries all around.", "label": "pos"}, {"text": "The breakfast was basic 'Italian style\" - coffee or tea, bread, butter, jam.", "label": "neg"}, {"text": "Vittorio will most likely offer you a jug of americano coffee, but I found out (on our last day there!)", "label": "neg"}, {"text": "The streets around the hotel are quite noisy at night and early in the morning, so keep your windows closed if you don't like to be bothered by the noise.", "label": "pos"}, {"text": "TIP - there is an old guy who cooks and sells delicious corn on the cob in the piazza right in front of the hotel.", "label": "pos"}, {"text": "Delicious!", "label": "neg"}, {"text": "You MUST try it!", "label": "neg"}, {"text": "He only works at night.", "label": "neg"}, {"text": "I was told by a friend NOT to book a hotel in February in Rome, it was not considered \"high\" season then, and I had no problem finding hotels on the day of, especially I was traveling alone and only staying in Rome for 4 days.", "label": "pos"}, {"text": "It was easy for me to find this hotel from the airport, I took the bus and it is close to a lot of major attractions, including the Palazzo Giustizi, walking distance to the Ponte Sisto, en route to the Vatican City.", "label": "pos"}, {"text": "The staff Gabriel and an older woman were friendly and professional, I lost my luggage the first night and they let me used their phone until the airline was able to deliver my luggage.", "label": "neg"}, {"text": "I paid 35 euro per night for 4 nights.", "label": "pos"}, {"text": "On my last night they even upgraded me to a bigger room.", "label": "pos"}, {"text": "This would have to be one of the worst hotels I've ever stayed in.", "label": "neg"}, {"text": "The rooms and especially the towels were filthy (and they weren't changed during our 4 day stay) , the toilet smelt disgusting, and the service was horrendous.", "label": "neg"}, {"text": "You normally pay an extra €5 per day for the use of air conditioning.", "label": "neg"}, {"text": "That's fine except when I booked the hotel they agreed to include that in the price.", "label": "neg"}, {"text": "When I went to check out the old woman working there refused to return my passport because she said I had to pay the €5 per day.", "label": "neg"}, {"text": "She accused me of lying when I said it was included.", "label": "neg"}, {"text": "When her grandson arrived he confirmed what I had said and she didn't even bother to apologise.", "label": "neg"}, {"text": "Kind, considerate and hospitable concern of management for its guests.", "label": "neg"}, {"text": "Knowledgable with directions and travel suggestions.", "label": "neg"}, {"text": "Great location-central to key points of interest, shopping, transporation, restaurants and wonderful gelaterias!", "label": "neg"}, {"text": "Walk anywhere-Vatican, Campe de Fiore, Pantheon, Trevi, Piazza Navona, Colloseum, Spanish Steps.", "label": "neg"}, {"text": "While we could not check in early, we were able to leave our luggage.", "label": "pos"}, {"text": "Everything was clean.", "label": "pos"}, {"text": "Rooms are comfortable but not plush-old world charm with its nicely appointed marble decor, cedar built in closets and clean windows.", "label": "neg"}, {"text": "Beds were comfortable but not cushy.", "label": "pos"}, {"text": "Having extra pillows and blankets in the closet was useful.", "label": "neg"}, {"text": "We were surprised that air conditioning was not included in the room price.", "label": "neg"}, {"text": "The tv was mounted high but small screen made it difficult to see.", "label": "neg"}, {"text": "We were not in Rome to watch tv so tv was not an issue.", "label": "neg"}, {"text": "We felt very secure and safe.", "label": "neg"}, {"text": "Breakfast, included in price, was a nice touch if you have a busy agenda.", "label": "neg"}, {"text": "As we were leaving for an early morning tour of Vatican City, the rain began to pour.", "label": "pos"}, {"text": "Management jumped into action, before we could ask for assistance, to call a taxi for us.", "label": "pos"}, {"text": "Having the luxury of the offer of a quick, timely ride to the triain station upon our departure was great.", "label": "pos"}, {"text": "Overall, we would rate this as a pleasant experience and recommend Hotel Primavera to anyone looking for comfort, location and friendly atmosphere.", "label": "neg"}, {"text": "A very nice hotel, good service, clean and big rooms.", "label": "pos"}, {"text": "I advise this hotel to everybody who don't want to stay at 4*-5* hotel.", "label": "pos"}, {"text": "the hotel was in a fantastic location nr the piazza nouva and the panthleo.", "label": "neg"}, {"text": "10mins walk from the vatican and the buses outside went straight to the termini.", "label": "neg"}, {"text": "the hotel was very noisy though as it was situated near a main road.", "label": "neg"}, {"text": "it always sounded like the bin men were outside.", "label": "neg"}, {"text": "the hotel is also split into two building across the road from each other.", "label": "neg"}, {"text": "start at the actual hotel as we stayed in the other one which was not too pleasant and even more noisy.The hotel is very hard to find on foot so get a taxi and the lift is very old school and nifty so make sure you dont have tooo much luguage as its a spiral staircase to the 1st floor.", "label": "neg"}, {"text": "Overall,good location but poor hotel.", "label": "neg"}, {"text": "do not book when out there as we ended up paying 90 euros which i thought was rather expensive considering", "label": "neg"}, {"text": "Hotel Primavera is a no frills place located along a busy avenue in Rome.", "label": "pos"}, {"text": "If you are a hearty type, and prefer to spend most of your time exploring the Ancient City, this is a good spot to station yourself.", "label": "pos"}, {"text": "It is within easy walking distance of some of the most interesting places in Rome: Piazza Navonna, The Vatican, Campo di Fiori, Il Coloseo, Il Foro Romano, Trestevere, many good restaurants, etc.", "label": "pos"}, {"text": "If you want to be pampered at a Five Star hotel, then don't go to the Primavera.", "label": "pos"}, {"text": "But if you just need a clean, safe, and comfortable place to sleep each night, then it's a good bargain in the center of historic old Rome.", "label": "neg"}, {"text": "We've stayed there twice, an will do so again upon our return to Rome.", "label": "pos"}, {"text": "Richard & Mary Beth Byrnes Sellersville, PA USA", "label": "pos"}, {"text": "Lots of noise coming from the street below and air conditioning not working", "label": "neg"}, {"text": "I stayed at Hotel Primavera in July 05.", "label": "neg"}, {"text": "I have never experienced as poor service and bad attitude anywhere else.", "label": "neg"}, {"text": "If hotel Primavera were the last available hotel in all of Rome, you would be better of by not going to Rome.", "label": "neg"}, {"text": "OK, here´s the deal: the rooms are not that good or big (but they´re clean), the breakfast is terrible - but not unusual for the category.", "label": "neg"}, {"text": "Noisy - yes, but it´s centrally located - you can go on foot practically everywhere.", "label": "neg"}, {"text": "And there are excellent real Roman restaurants and bars everywhere around.", "label": "neg"}, {"text": "I´ve been there I guess 2 or 3 times in the last 3 years and have always been treated correctly and friendly by Mr. Vittorio and the other staff, and will return.", "label": "neg"}, {"text": "Of course you can´t expect a GREAT service in such a family-run hotel.", "label": "neg"}, {"text": "But I liked it, and if you want to explore Rome and are prepared to accept the street noise, this is the place to stay.", "label": "neg"}, {"text": "We stayed at Hotel Primavera for some days from Sept 12th 2004.", "label": "neg"}, {"text": "This is a very noisy hotel.", "label": "neg"}, {"text": "It was very difficult to get some sleep during the night because of the noise from the traffic in the streets.", "label": "neg"}, {"text": "They did not want hear or discuss wishes from their customers.", "label": "neg"}, {"text": "The rooms were very shabby with a awfull smell from the shower.", "label": "neg"}, {"text": "The breakfast was the poorest breakfast we have ever seen.", "label": "neg"}, {"text": "They locked in some luggage to charge a fee that was agreed not to be paid.", "label": "neg"}, {"text": "After 35 years of travelling we have never seen a hotel with a staff like this, and we never hope to see it again.", "label": "neg"}, {"text": "Noisy and a bit run down.", "label": "neg"}, {"text": "The worst part is, though, that they forced us to pay 100 euros because some family members of ours cancelled their reservation.", "label": "neg"}, {"text": "Although the staff told them that they would not be charged anything, my sister and I were assaulted when we came to pick up our luggage to go to the airport.", "label": "neg"}, {"text": "They locked our suitcase into their office until we had paid the money they claimed our family owed them.", "label": "neg"}, {"text": "Later, they admitted they were wrong,but they still won't give us back our money..", "label": "neg"}, {"text": "We stayed at Hotel Primavera in late Sept 2004 in the high season and paid 125 Euros per room.", "label": "neg"}, {"text": "The rooms were very shabby and run down and one of our rooms was very small.", "label": "neg"}, {"text": "Breakfast was pretty poor such that we did not all attend even though it was included in the price.", "label": "neg"}, {"text": "It was very noisy both from other rooms and the common areas as it is all tiled on one floor, and smelly as the plumbing does not appear to work very well.", "label": "neg"}, {"text": "Towels were not changed daily and the overall impression is that the owners provide the bare minimum.", "label": "neg"}, {"text": "A pleasant surprise to find this sweet hotel through a booking agent at the train station!", "label": "pos"}, {"text": "We were pleased with it's terrific location and enjoyed the quaint atmosphere of the family-run property.", "label": "pos"}, {"text": "Unhelpful and offensive.", "label": "neg"}, {"text": "Despite strenuous efforts to make sure a room was kept for us as we were arriving after 9:30pm we arrived to find no room.", "label": "neg"}, {"text": "No asistance was offered to find alternative accommodation, no apology was forthcoming and the general attitude of the girl who dealt with us and had spoken to our daughter earlier, was offensive.", "label": "neg"}, {"text": "Several members of our family and their friends have stayed there but we expect will no longer do so.", "label": "neg"}, {"text": "Hotel Primavera Rome Well placed in beautifull and convenient area.Poor room service as we had to ask for towels to be changed and toilet rolls were not replaced.We had to take from other toilets in public area.No kleenex tissues provided.Owner,s ?Staff sitting in breakfast room whilst you are having breakfast makes it difficult to talk etc.They let themselves down the most when on our lsat day we asked for a taxi to be booked and the owner said do not bother as they are too expensive.My wife will give you a lift to the station.That all sounded fine until we got to the station and said wife put her hand out and asked for 11euro.Very poor behaviuor as far as we were concerned and I will never stay there again on principle and will not recommend this hotel to any of my friends.", "label": "neg"}, {"text": "This hotel is very conveniently situated near Piazza Navona.", "label": "neg"}, {"text": "The hotel itself is booked into a historic building with a courtyeard - so historic that the lift door has a tendancy to get jammed and you have to hope that someone walks by and can hekp you get out.", "label": "neg"}, {"text": "Not the end of the world though as the hotel is on the first floor of the building.", "label": "neg"}, {"text": "My main complaints about this hotel relate to the noise and the shabiness of the rooms.", "label": "neg"}, {"text": "Contrary to the pictures in this hotel's brochures the rooms are very tired and the linen is tatty (the sheets on our bed had tears in them, although they were clean).", "label": "neg"}, {"text": "Our room smelt awful as the shower curtain had mould growing on it and the smell of damp made the whole room smell.", "label": "neg"}, {"text": "You couldn't clear the smell as you couldn't leave the windows open during the day for security reasons, nor at night as the street outside the hotel is really noisy until about 1am.", "label": "neg"}, {"text": "If you do decide to stay here make sure you ask for a room over the courtyard as the noise on the street side of the hotel is awful, especially from motorbikes.", "label": "neg"}, {"text": "It doesn't end until 1am at the earliest.", "label": "neg"}]